
## Terraform plan for environment: `int`

**Commit:** f43d4c04ed1c8a057c6890a720424d0f9f388e79


**API version:** f7c780e623
**CLI version:** f7c780e623
**Selfserve version:** f7c780e623
**Internal version:** f7c780e623
**search version:** e8b34f85c1

### Plan summary

`4 to add, 84 to change, 1 to destroy`

**🆕 Creates**

```tf
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
module.service.module.sns_batch_failure.aws_sns_topic_subscription.this["vol-app-int-batch-failure-email-olcs-dev"]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["search"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-clean-up-variations"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-close-expired-windows"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-cns"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-company-profile-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-create-psv-licence-surrender-task"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-digital-continuation-reminders"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-duplicate-vehicle-warning"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-enqueue-ch-compare"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-expire-bus-registration"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-flag-urgent-tasks"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-inspection-request-email"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-interim-end-date-enforcement"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-international-goods-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-last-tm-letter"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-licence-status-rules"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-mark-expired-permits"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-company-profile"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-insolvency"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-insolvency-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-ntu"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-community-licences"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-disc-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-disc-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-ecmt-accept"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-general"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-irhp-allocate"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-permit-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-permit-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-process-queue-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-psv-operator-list-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-remove-read-audit"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-resolve-payments"]
module.service.module.eventbridge.aws_scheduler_schedule.this["int-transxchange-consumer"]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "7082834157031175638" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_api_image_tag"       = "release-v5.20.23-rc16" -> "f7c780e623"
          ~ "deployed_assets_version"      = "release-v5.20.23-rc16" -> "release-v5.17.0"
          ~ "deployed_cli_image_tag"       = "release-v5.20.23-rc16" -> "f7c780e623"
          ~ "deployed_internal_image_tag"  = "release-v5.20.23-rc16" -> "f7c780e623"
          ~ "deployed_selfserve_image_tag" = "release-v5.20.23-rc16" -> "f7c780e623"
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cancel-unsubmitted-bilateral:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cancel-unsubmitted-bilateral:179"
        name                       = "vol-app-int-cancel-unsubmitted-bilateral"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-ch-vs-olcs-diffs:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-ch-vs-olcs-diffs:179"
        name                       = "vol-app-int-ch-vs-olcs-diffs"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-clean-up-variations:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-clean-up-variations:179"
        name                       = "vol-app-int-clean-up-variations"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-close-expired-windows:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-close-expired-windows:179"
        name                       = "vol-app-int-close-expired-windows"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cns:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cns:179"
        name                       = "vol-app-int-cns"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-company-profile-dlq:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-company-profile-dlq:179"
        name                       = "vol-app-int-company-profile-dlq"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-create-psv-licence-surrender-task:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-create-psv-licence-surrender-task:179"
        name                       = "vol-app-int-create-psv-licence-surrender-task"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-delete:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-delete:179"
        name                       = "vol-app-int-data-retention-delete"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-populate:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-populate:179"
        name                       = "vol-app-int-data-retention-populate"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-postcheck:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-postcheck:179"
        name                       = "vol-app-int-data-retention-postcheck"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-precheck:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-precheck:179"
        name                       = "vol-app-int-data-retention-precheck"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-database-maintenance:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-database-maintenance:179"
        name                       = "vol-app-int-database-maintenance"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-digital-continuation-reminders:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-digital-continuation-reminders:179"
        name                       = "vol-app-int-digital-continuation-reminders"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-warning:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-warning:179"
        name                       = "vol-app-int-duplicate-vehicle-warning"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-enqueue-ch-compare:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-enqueue-ch-compare:179"
        name                       = "vol-app-int-enqueue-ch-compare"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-expire-bus-registration:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-expire-bus-registration:179"
        name                       = "vol-app-int-expire-bus-registration"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-flag-urgent-tasks:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-flag-urgent-tasks:179"
        name                       = "vol-app-int-flag-urgent-tasks"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-import-users-from-csv:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-import-users-from-csv:179"
        name                       = "vol-app-int-import-users-from-csv"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-inspection-request-email:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-inspection-request-email:179"
        name                       = "vol-app-int-inspection-request-email"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-interim-end-date-enforcement:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-interim-end-date-enforcement:179"
        name                       = "vol-app-int-interim-end-date-enforcement"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-international-goods-export:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-international-goods-export:179"
        name                       = "vol-app-int-international-goods-export"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-last-tm-letter:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-last-tm-letter:179"
        name                       = "vol-app-int-last-tm-letter"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-licence-status-rules:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-licence-status-rules:179"
        name                       = "vol-app-int-licence-status-rules"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-mark-expired-permits:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-mark-expired-permits:179"
        name                       = "vol-app-int-mark-expired-permits"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-cl"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-cl:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-cl:179"
        name                       = "vol-app-int-process-cl"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-company-profile"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-company-profile:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-company-profile:179"
        name                       = "vol-app-int-process-company-profile"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-inbox"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-inbox:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-inbox:179"
        name                       = "vol-app-int-process-inbox"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency:179"
        name                       = "vol-app-int-process-insolvency"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency-dlq:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency-dlq:179"
        name                       = "vol-app-int-process-insolvency-dlq"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-ntu"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-ntu:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-ntu:179"
        name                       = "vol-app-int-process-ntu"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-community-licences:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-community-licences:179"
        name                       = "vol-app-int-process-queue-community-licences"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-disc-generation:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-disc-generation:179"
        name                       = "vol-app-int-process-queue-disc-generation"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-disc-print:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-disc-print:179"
        name                       = "vol-app-int-process-queue-disc-print"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-ecmt-accept:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-ecmt-accept:179"
        name                       = "vol-app-int-process-queue-ecmt-accept"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-general"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-general:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-general:179"
        name                       = "vol-app-int-process-queue-general"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-irhp-allocate:179" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.20.23-rc16" -> "QA"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "QA" -> "f7c780e623"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.20.23-rc16" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:f7c780e623"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-irhp-allocate:179"
        name                       = "vol-app-int-process-queue-irhp-allocate"
      ~ revision                   = 179 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-permit-generation:179" -> (known after apply)
      ~ container_properties       = jsonencode(
... (truncated, see full plan in the workflow run logs)
```

</details>